Repository: earthlingsoft/Earth-Addresser
Catalog: Localisation/Source/Earth Addresser git/*.lproj/Localizable.strings
Languages: fr

source: address
fr: adresse

source: addresses
fr: adresses

source: %i %@ with %i %@
fr: %i %@ avec %i %@

source: Select Group
fr: Choisir le groupe

source: The selected contacts contain one address whose coordinates have not been looked up yet.
fr: Les contacts sélectionnés contiennent une adresse dont les coordonnées n’ont pas encore regardées.

source: The selected contacts contain %i addresses whose coordinates have not been looked up yet.
fr: Les contacts sélectionnés contiennent %i adresses dont les coordonnées n’ont pas encore regardées.

source: All the addresses you selected have been looked up already. Unfortunately %i of them could not be located.
fr: Toutes les adresses sélectionnées ont déjà été regardées. Malheureusement, %i d’entre elles n’ont pas pu être localisées.

source: All the addresses you selected have been looked up already. Unfortunately one of them could not be located.
fr: Toutes les adresses sélectionnées ont déjà été regardées. Malheureusement, l’une d’elles n’a pas pu être localisée.

# All the addresses you selected have been looked up already.
source: The selected addresses have already been looked up.
fr: Les adresses sélectionnées ont déjà été regardées.

source: The contacts you selected do not contain any addresses. Please try a different selection for things to be more useful.
fr: Les contacts sélectionnés ne contiennent pas d’adresses. Veuillez essayer avec une autre sélection pour que cela soit plus utile.

# File '%@' on your Desktop
source: Placemarks file “%@” has been created on the Desktop.
fr: Un fichier de repères « %@ » a été créé sur le Bureau.

# Placemark generation was cancelled.
source: Creation of Placemarks file was cancelled.
fr: Création du fichier de repères annulée.

source: Look Up Coordinates
fr: Rechercher les coordonnées

source: Cancel Lookup
fr: Annuler la recherche

# Cancel Placemark Creation
source: Cancel
fr: Annuler

source: Create Placemarks
fr: Créer des repères

# Selected group wasn't recognisable.
source: Earth Addresser could not recognise the selected address group.
fr: Earth Addresser ne reconnaît pas le groupe d’adresse sélectionné.

source: Addresses
fr: Adresses

source: E-Mail
fr: Adresse électronique

source: Phone
fr: Téléphone

# PayPal Region Code
source: US
fr: FR
