Repository: earthlingsoft/Earth-Addresser
Catalog: *.lproj/Localizable.strings
Languages: de

source: address
de: Adresse

source: addresses
de: Adressen

source: contact
de: Visitenkarte

source: contacts
de: Visitenkarten

source: %i %@ with %i %@
de: %i %@ mit %i %@

source: The selected contacts contain one address whose coordinates have not been looked up yet.
de: Die Auswahl enthält eine Adresse, deren Koordinaten noch nicht ermittelt wurden.

source: The selected contacts contain %i addresses whose coordinates have not been looked up yet.
de: Die Auswahl enthält %i Adressen, deren Koordinaten noch nicht ermittelt wurden.

source: All the addresses you selected have been looked up already. Unfortunately %i of them could not be located.
de: Es wurden bereits alle Adressen nachgeschlagen. Für %i der Adressen konnten die zugehörigen Koordinaten nicht ermittelt werden.

# All the addresses you selected have been looked up already.
source: The selected addresses have already been looked up.
de: Die Koordinaten aller ausgewählten Adressen sind bereits ermittelt.

source: The contacts you selected do not contain any addresses. Please try a different selection for things to be more useful.
de: Die Auswahl enthält keine Adressen.

# File '%@' on your Desktop
source: Placemarks file “%@” has been created on the Desktop.
de: Die Ortsmarkendatei „%@“ liegt auf dem Schreibtisch.

# Couldn't create Application Support/EarthAddresser folder
source: Earth Addresser was unable to create the “~/Library/Application Support/Earth Addresser” folder.
de: Der Ordner Application Support/EarthAddresser konnte nicht erstellt werden

# Couldn't create Application Support/EarthAddresser/Images folder
source: Earth Addresser was unable to create the “~/Library/Application Support/Earth Addresser/Images” folder.
de: Der Ordner Application Support/EarthAddresser/Images konnte nicht erstellt werden

# Couldn't create temporary folder
source: Earth Addresser failed to create a temporary folder.
de: Temporärer Ordner konnte nicht erstellt werden

# Selected group wasn't recognisable.
source: Earth Addresser could not recognise the selected address group.
de: Die ausgewählte Gruppe konnte nicht gefunden werden.

# Filename
source: Contacts
de: Adressen

source: Addresses
de: Adressen

# open in AddressBook
source: View in Address Book
de: Im Adressbuch anzeigen

source: Phone
de: Telephon
