 <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
        "http://www.w3.org/TR/1999/REC-html401-19991224/strict.dtd">
<html>
<head>
<title>Earth Addresser</title>
<style type="text/css">
body { background:#eee; color:555; text-align:center; font-family:Georgia, Garamond,Palatino,Times,serif; }
#main { max-width:35em; padding:3em 1em 1em 0;margin:auto; line-height:1.4em;}
h1 { font-family:Zapfino; font-weight:normal;}
dl dt { font-style:italic; margin:2em 0em 0.5em 0em;}
ul {list-style-type:none; padding:0px; }
ul li, dl dd ul, dl dd {margin:0px; padding:0px;}
ul.links li { display : inline;}
ul.links li:before { content: '\002022'; margin:0em 0.3em; }
ul.links li.i1:before { content:'';}
a {text-decoration:none;}
#oldversions  { display:none;}
#oldversions:target + p { display:none;}
#oldversions:target { display:block;} 
h3 { margin:3em 0em 1em 0em;}
</style>
</head>
<body>
<div id="main">
<h1>Earth Addresser</h1>

<p>
Deine Adressen in Google Earth.
</p>
<p>
Das Adressbuch im Computer randvoll mit Adressen und begeistert von Google Earth? Dann wird Earth Addresser die perfekte Erg&auml;nzung sein. Das Programm schreibt die Adressen aus dem Adressbuch in eine &sbquo;KML&lsquo; Datei, die Google Earth lesen kann, um dann die Adressen auf der Weltkarte anzuzeigen. Wenn die Visitenkarten im Adressbuch Photos enthalten, wird anstelle der &uuml;blichen Stecknadel das Photo der Person auf der Weltkarte angezeigt.
</p>
<p>
Damit Google Earth die Adressen an der korrekten Stelle anzeigt, mu&szlig; zun&auml;chst die Adresse in Koordinaten auf der Erdkugel umgewandelt werden. Diese Umwandlung nimmt ein weiterer Dienst von Google vor. Das hei&szlig;t, da&szlig; jede vom Earth Addresser verarbeitet Adresse einmal zu Google geschickt wird. <em>Falls Du Bedenken hast, Deine Adressen Google preiszugeben, solltest Du Earth Addresser nicht verwenden.</em> Bei dieser Umwandlung wird <em>nur</em> der Inhalt der Adressfelder im Adressbuch an Google gesendet. Der Name der Person und andere Kontaktinformationen werden nicht verschickt.
</p>
<p>
Weiterhin kann der Google-Dienst nicht jede Adresse korrekt in Koordinaten umwandeln. Dies kann an mehreren Dingen liegen.
</p>
<ol>
<li>Landesinformationen: Um Probleme mit Tippfehlern und verschiedenen Sprachen zu vermeiden nutzt Earth Addresser <em>nicht</em> das eingetippte Land im Adressbuch. Stattdessen wird das  Land genutzt, f&uuml;r das das <em>Adressformat</em> der Adresse eingestellt wurde.  Das Adressformat kann eingestellt werden, indem im Bearbeiten Modus auf das Etikett einer Adresse geklickt  und  das gew&uuml;nschte Land im Untermen&uuml; &sbquo;Adressformat &auml;ndern&lsquo; ausgew&auml;hlt wird.

</li>
<li>
Unbekannte Abk&uuml;rzungen in der Adresse: Google hat Schwierigkeiten mit einigen Adre&szlig;zus&auml;tzen wie &sbquo;Zimmer&lsquo; oder &sbquo;Postfach&lsquo;. Earth Addresser erkennt einige von diesen und entfernt sie. Es kann aber gut sein, da&szlig; andere Zus&auml;tze unerkannt bleiben. 
</li>
<li>
Datenbestand von Google: In manchen L&auml;ndern hat Google nicht alle Stra&szlig;ennamen erfa&szlig;t. Adressen auf nicht erfa&szlig;ten Stra&szlig;en k&ouml;nnen nicht korrekt in Koordinaten umgewandelt werden und Earth Addresser entfernt diese aus den Ergebnissen.
</li>
</ol>
<p>
Vielen Dank an Nat Bletter, der die Idee f&uuml;r Earth Addresser angesto&szlig;en hat, an Dan Wood f&uuml;r seine Cocoa-Ratschl&auml;ge und an Ronald Leroux f&uuml;r die Franz&ouml;sische Lokalisierung.
</p>
<p>
Viel Spa&szlig;.
</p>
<ul class="links">
<li class="i1"><a href="http://earthlingsoft.net/Earth%20Addresser">Earth Addresser Webseite</a></li>
<li><a href="http://earthlingsoft.net/">earthlingsoft Website</a></li>
<li><a href="https://www.paypal.com/xclick/business=earthlingsoft%40earthlingsoft.net&amp;item_name=Earth%20Addresser&amp;no_shipping=1&amp;cn=Comments&amp;tax=0&amp;currency_code=EUR">Spenden</a></li>
<li><a href="mailto:earthlingsoft@earthlingsoft.net?subject=Earth%20Addresser">E-Mail senden</a></li>
<li><a href="http://earthlingsoft.net/ssp/blog/2007/03/earth_addresser#comments">Kommentar hinterlassen</a></li>
</ul>


<h3>Versionsgeschichte</h3>
<dl class="versions" id="latestversion">
<dt>v2 (2009-01-03)</dt>
<dd>
<ul>
<li>Vollst&auml;ndig &uuml;berarbeitete Benutzeroberfl&auml;che</li>
<li>Die Umwandlung von Adressen wird nun von Earth Addresser und nicht von Google Earth vorgenommen. Ergebnisse werden hierbei gespeichert und wiederverwendet.</li>
<li>Die Daten in der erzeugten KML Datei lassen sich feiner einstellen. Insbesondere k&ouml;nnen nun Dateien ohne Namen und mit Telephonnummern und E-Mail Adressen geschrieben werden.</li>
<li>Die Ortsmarken in Google Earth enthalten nun Bilder.</li>
<li>Die Links zum Adressbuch sind nun zuverl&auml;ssig klickbar.</li>
</ul>
</dd>

<dt>v1 (2) (2007-04-26)</dt>
<dd>
Updatesuche korrigiert, so da&szlig; sie nach den richtigen Updates sucht.
</dd>

<dt>v1 (2007-03-30)</dt>
<dd>
Erste ver&ouml;ffentlichte Version
</dd>



</dl>


<dl class="versions" id="oldversions">
<dt>version 1b3 (2007-03-28)</dt>
<dd>
<ul>
<li>added checking for updates</li>
<li>added French localisation contributed by Ronald Leroux</li>
<li>added German localisation</li>
<li>minor UI improvements</li>
</ul>
</dd>


<dt>version 1b2 (2007-03-27)</dt>
<dd>
hopefully fixed a problem that made the application stall
</dd>


<dt>version 1b (2007-03-26)</dt>
<dd>
<ul>
<li>first testing release</li>	
<li>more fixes and polish</li>
</ul>
</dd>
<dt>version 0.4 (unreleased)</dt>
<dd>
<ul>
<li>removed the 'smarts' again as they didn't work</li>
<li>new strategy: write image files to Application Support folder and output a KML file only</li>
<li>set size of images in Preferences</li>
</ul>
</dd>
<dt>version 0.3 (unreleased)</dt>
<dd>
<ul>
<li>introduced the 'smarts' to pack everything up in a nice KMZ file</li>
<li>unfortunately GoogleEarth doesn't load Icon href elements from within the KMZ file</li>
<li>also removed colons from id attributes and file names</li>
</ul>
</dd>
<dt>version 0.2 (unreleased)</dt>
<dd>
	rewrote XML generation to use NSXML so we can have actual, properly-escaped XML
</dd>
<dt>version 0.1 (unreleased)</dt>
<dd>
	initial build
</dd>
</dl>

<p id="morehistorylinks"><a href="#oldversions" id="showolder">Complete list</a></p>

</div>
</body>
</html>